app/controllers/tamplates_controller.rb

SELECT "tamplates".* FROM "tamplates" WHERE "tamplates"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_tamplate
    @tamplate = Tamplate.find(params[:id])