app/controllers/tamplates_controller.rb

INSERT INTO "tamplates" ("name", "chernovik", "opisanie", "templ_type", "koef", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "123"], ["chernovik", "123"], ["opisanie", "123"], ["templ_type", 123], ["koef", 123], ["created_at", "2022-05-05 07:52:25.823615"], ["updated_at", "2022-05-05 07:52:25.823615"]]
---
  def create

    tamplate = Tamplate.create(tamplate_params)

UPDATE "tamplates" SET "name" = ?, "chernovik" = ?, "opisanie" = ?, "updated_at" = ? WHERE "tamplates"."id" = ?  [["name", "s2`12`1"], ["chernovik", "`12`12`"], ["opisanie", "`1`2"], ["updated_at", "2022-05-04 17:34:30.699943"], ["id", 2]]
---
  def update
    @tamplate.update(tamplate_params)

DELETE FROM "tamplates" WHERE "tamplates"."id" = ?  [["id", 5]]
---
  def destroy
    @tamplate.destroy

SELECT "tamplates".* FROM "tamplates"
---
  def index
    @tamplates = Tamplate.all

SELECT "tamplates".* FROM "tamplates" WHERE "tamplates"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def set_tamplate
    @tamplate = Tamplate.find(params[:id])